## Terraform Plan
#### Terraform Format: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
module.gcp_vpc.google_compute_network.ml_network: Refreshing state... [id=projects/aitech-good-s17919/global/networks/ml-network]
module.gcp_iam.google_service_account.vertex_account: Refreshing state... [id=projects/aitech-good-s17919/serviceAccounts/vertex-account@aitech-good-s17919.iam.gserviceaccount.com]
module.gcp_gcs.google_storage_bucket.vertex: Refreshing state... [id=aitech-good-s17919-vertex]
module.gcp_iam.google_project_iam_member.vertex_account_user: Refreshing state... [id=aitech-good-s17919/roles/aiplatform.user/serviceAccount:vertex-account@aitech-good-s17919.iam.gserviceaccount.com]
module.gcp_vpc.google_compute_subnetwork.ml_network_subnet: Refreshing state... [id=projects/aitech-good-s17919/regions/asia-northeast1/subnetworks/ml-network-subnet]
module.gcp_vpc.google_compute_firewall.ml_network_allow_ssh: Refreshing state... [id=projects/aitech-good-s17919/global/firewalls/ml-network-allow-ssh]
module.gcp_iam.google_storage_bucket_iam_member.vertex_gcs_bucket_writer: Refreshing state... [id=b/aitech-good-s17919-vertex/roles/storage.legacyBucketWriter/serviceAccount:vertex-account@aitech-good-s17919.iam.gserviceaccount.com]
module.gcp_iam.google_storage_bucket_iam_member.vertex_gcs_object_viewer: Refreshing state... [id=b/aitech-good-s17919-vertex/roles/storage.objectViewer/serviceAccount:vertex-account@aitech-good-s17919.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp_vertex.google_notebooks_instance.ml_experiment will be created
  + resource "google_notebooks_instance" "ml_experiment" {
      + boot_disk_size_gb  = 100
      + boot_disk_type     = "PD_BALANCED"
      + create_time        = (known after apply)
      + data_disk_size_gb  = 100
      + data_disk_type     = "PD_BALANCED"
      + id                 = (known after apply)
      + install_gpu_driver = true
      + labels             = (known after apply)
      + location           = "asia-northeast1-a"
      + machine_type       = "n1-standard-4"
      + name               = "ml-experiment"
      + network            = "projects/aitech-good-s17919/global/networks/ml-network"
      + project            = (known after apply)
      + proxy_uri          = (known after apply)
      + service_account    = "vertex-account@aitech-good-s17919.iam.gserviceaccount.com"
      + state              = (known after apply)
      + subnet             = "projects/aitech-good-s17919/regions/asia-northeast1/subnetworks/ml-network-subnet"
      + update_time        = (known after apply)

      + accelerator_config {
          + core_count = 1
          + type       = "NVIDIA_TESLA_T4"
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = (known after apply)
          + enable_secure_boot          = (known after apply)
          + enable_vtpm                 = (known after apply)
        }

      + vm_image {
          + image_name = "tf-ent-2-11-cu113-notebooks-v20230807-debian-11-py310"
          + project    = "deeplearning-platform-release"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```
</details>